#+TITLE: Ejercicios del Tema 4
#+SUBTITLE: Vectores
#+AUTHOR: 
#+DATE: 
#+SETUPFILE: config.org
#+PROPERTY: header-args :exports none
#+EXPORT_FILE_NAME: ejercicios_tema4_vectores.pdf


* Producto escalar de vectores
Escribe un programa que realice el producto escalar de dos vectores. Use los dos vectores siguientes como ejemplo.

#+BEGIN_SRC C  :exports code
  float v1[5] = {1, 34, 32, 45, 34};
  float v2[5] = {12, -3, 34, 15, -5};
#+END_SRC

#+BEGIN_SRC C 
#include <stdio.h>
int main()
{
  float v1[5] = {1, 34, 32, 45, 34};
  floes at v2[5] = {12, -3, 34, 15, -5};
  // Es necesario inicializar la variable para hacer la suma del producto escalar
  float prod = 0;
  int i;

  for(i=0; i<5; i++)
  {
    prod = prod + v1[i] * v2[i];
  }
    
  printf("El producto escalar es: %f\n", prod);
  
  return 0;
}
#+END_SRC

#+RESULTS:
: El producto escalar es: 1503.000000


* Ordenamiento de vectores
Escribe un programa que ordene de menor a mayor los elementos de un vector de 5 elementos. Los valores del vector serán introducidos por teclado, y el vector ordenado será mostrado por pantalla. 

#+BEGIN_SRC C 
#include <stdio.h>

#define N 5

int main()
{
  int datos[N];
  int i, j, aux;
  
  //Primero pedimos los datos
  for(i = 0; i < N; i++)
  {
    printf("Dato %d: ", i + 1);
    scanf("%i", &datos[i]);
  }
  
  //Ahora lo ordenamos
  for(i = 0; i < N - 1; i++)
  {
    // Comparamos cada elemento con el siguiente
    for(j = i + 1; j < N; j++)
    {
      if (datos[i] > datos[j])
      {
        // Si es mayor intercambiamos el contenido de los dos elementos
        aux = datos[i]; //Necesitamos una variable auxiliar de almacenamiento temporal
        datos[i] = datos[j];
        datos[j] = aux;
      }
    }
  }
  
  //sacamos el vector por pantalla
  printf("Vector ordenado: ");
  for(i = 0; i < 5; i++)
  {
    printf("%i ", datos[i]);
  }
    
  return 0;
}
#+END_SRC

#+RESULTS:
: Vector: 1 12 23 45 50


